Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
#if LWIP_IPV4
static cy_lwip_dhcp_server_t internal_dhcp_server;
#endif

/* Interface init status */
static bool ip_networking_inited[CY_IFACE_MAX_HANDLE];
#define SET_IP_NETWORK_INITED(interface_index, status)   (ip_networking_inited[(interface_index)&3] = status)

/* Interface UP status */
static bool ip_up[CY_IFACE_MAX_HANDLE];
#define SET_IP_UP(interface_index, status)               (ip_up[(interface_index)&3] = status)

struct  netif                                           *cy_lwip_ip_handle[CY_IFACE_MAX_HANDLE];
#define LWIP_IP_HANDLE(interface)                        (cy_lwip_ip_handle[(interface) & 3])

static struct netif       sta_ip_handle;
static struct netif       ap_ip_handle;
static struct netif       eth0_ip_handle;
static struct netif       eth1_ip_handle;

struct netif* cy_lwip_ip_handle[CY_IFACE_MAX_HANDLE] =
{
    [0] =  &sta_ip_handle,
    [1] =  &ap_ip_handle,
    [2] =  &eth0_ip_handle,
    [3] =  &eth1_ip_handle
};

struct icmp_packet
{
    struct   icmp_echo_hdr hdr;
    uint8_t  data[PING_DATA_SIZE];
};

cy_network_interface_context iface_context_database[CY_IFACE_MAX_HANDLE];
static uint8_t iface_count = 0;
static uint8_t connectivity_lib_init = 0;
static bool is_tcp_initialized       = false;

#ifdef COMPONENT_43907
static uint32_t prng_well512_state[CY_PRNG_WELL512_STATE_SIZE];
static uint32_t prng_well512_index = 0;

static uint32_t prng_add_cyclecnt_entropy_bytes = CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE;

/** Mutex to protect the PRNG state array */
static cy_mutex_t cy_prng_mutex;
static cy_mutex_t *cy_prng_mutex_ptr;

#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
cy_worker_thread_info_t          cy_rx_worker_thread;
cy_queue_t                       rx_input_buffer_queue;
cy_worker_thread_info_t          cy_tx_worker_thread;
cy_semaphore_t                   tx_semaphore = NULL;
cy_mutex_t                       tx_mutex;
static cy_internal_buffer_pool_t *rx_pool_handle = NULL;
uint8_t *pRx_Q_buff_pool[CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE];
#endif
#endif

/******************************************************
 *               Static Function Declarations
 ******************************************************/
#if defined(CYBSP_ETHERNET_CAPABLE)
extern err_t ethernetif_init(struct netif* netif);
#endif

#if LWIP_IPV4
static void invalidate_all_arp_entries(struct netif *netif);
#endif
static void internal_ip_change_callback (struct netif *netif);
static bool is_interface_added(uint8_t interface_index);
static cy_rslt_t is_interface_valid(cy_network_interface_context *iface);
static bool is_network_up(uint8_t interface_index);

#if LWIP_IPV4
static void ping_prepare_echo(struct icmp_packet *iecho, uint16_t len, uint16_t *ping_seq_num);
static err_t ping_send(int socket_hnd, const cy_nw_ip_address_t* address, struct icmp_packet *iecho, uint16_t *sequence_number);
static err_t ping_recv(int socket_hnd, cy_nw_ip_address_t* address, uint16_t *ping_seq_num);
#endif

#ifdef COMPONENT_43907
static uint32_t prng_well512_get_random ( void );
static void     prng_well512_add_entropy( const void* buffer, uint16_t buffer_length );
cy_rslt_t cy_prng_get_random( void* buffer, uint32_t buffer_length );
cy_rslt_t cy_prng_add_entropy( const void* buffer, uint32_t buffer_length );
#endif

/******************************************************
 *               Function Definitions
 ******************************************************/

#if defined(CYBSP_WIFI_CAPABLE)
/*
 * This function takes packets from the radio driver and passes them into the
 * lwIP stack. If the stack is not initialized, or if the lwIP stack does not
 * accept the packet, the packet is freed (dropped). If the packet is of type EAPOL
 * and if the Extensible Authentication Protocol over LAN (EAPOL) handler is registered, the packet will be redirected to the registered
 * handler and should be freed by the EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t iface, whd_buffer_t buf)
{
    uint8_t *data = whd_buffer_get_current_piece_data_pointer(iface->whd_driver, buf);
    uint16_t ethertype;
    struct netif *net_interface = NULL;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "%s(): START iface->role:[%d]\n", __FUNCTION__, iface->role );

    if(iface->role == WHD_STA_ROLE)
    {
        net_interface = &sta_ip_handle;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "STA net_interface:[%p] \n", net_interface);
    }
    else if(iface->role == WHD_AP_ROLE)
    {
        net_interface = &ap_ip_handle;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AP net_interface:[%p] \n", net_interface);
    }
    else
    {
        cy_buffer_release(buf, WHD_NETWORK_RX) ;
        return;
    }

    ethertype = (uint16_t)(data[12] << 8 | data[13]);
    if (ethertype == EAPOL_PACKET_TYPE)
    {
        if( internal_eapol_packet_handler != NULL )
        {
            internal_eapol_packet_handler(iface, buf);
        }
        else
        {
            cy_buffer_release(buf, WHD_NETWORK_RX) ;
        }
    }
    else
    {
        /* Call the registered activity handler with the argument as false
         * indicating that there is RX packet
         */
        if (activity_callback)
        {
            activity_callback(false);
        }

        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Send data up to LwIP \n");
        /* If the interface is not yet set up, drop the packet */
        if (net_interface->input == NULL || net_interface->input(buf, net_interface) != ERR_OK)
        {
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Drop packet before lwip \n");
            cy_buffer_release(buf, WHD_NETWORK_RX) ;
        }
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
}

/* Create a duplicate pbuf of the input pbuf */
static struct pbuf *pbuf_dup(const struct pbuf *orig)
{
    struct pbuf *p = pbuf_alloc(PBUF_LINK, orig->tot_len, PBUF_RAM);
    if (p != NULL)
    {
        pbuf_copy(p, orig);
        p->flags = orig->flags;
    }
    return p;
}

