Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
/*
 * This function takes the packets from the lwIP stack and sends them down to the radio.
 * If the radio is not ready, return and error; otherwise, add a reference to
 * the packet for the radio driver and send the packet to the radio driver. The radio
 * driver puts the packet into a send queue and sends it based on another thread. This
 * other thread will release the packet reference once the packet is actually sent.
 */
static err_t wifioutput(struct netif *iface, struct pbuf *p)
{
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if (whd_wifi_is_ready_to_transceive((whd_interface_t)if_ctx->hw_interface) != WHD_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Wi-Fi is not ready, packet not sent\n");
        return ERR_INPROGRESS ;
    }

    struct pbuf *whd_buf = pbuf_dup(p);
    if (whd_buf == NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate buffer for outgoing packet\n");
        return ERR_MEM;
    }
    /* Call the registered activity handler with the argument as true
     * indicating there is TX packet
     */
    if (activity_callback)
    {
        activity_callback(true);
    }
    whd_network_send_ethernet_data((whd_interface_t)if_ctx->hw_interface, whd_buf) ;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );

    return ERR_OK ;
}


#if LWIP_IPV4 && LWIP_IGMP
/*
 * Respond to IGMP (group management) requests
 */
static err_t igmp_filter(struct netif *iface, const ip4_addr_t *group, enum netif_mac_filter_action action)
{
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    whd_mac_t mac = { MULTICAST_IP_TO_MAC((uint8_t*)group) };

    switch ( action )
    {
        case NETIF_ADD_MAC_FILTER:
            if ( whd_wifi_register_multicast_address( (whd_interface_t)if_ctx->hw_interface, &mac ) != CY_RSLT_SUCCESS )
            {
                return ERR_VAL;
            }
            break;

        case NETIF_DEL_MAC_FILTER:
            if ( whd_wifi_unregister_multicast_address( (whd_interface_t)if_ctx->hw_interface, &mac ) != CY_RSLT_SUCCESS )
            {
                return ERR_VAL;
            }
            break;

        default:
            return ERR_VAL;
    }

    return ERR_OK;
}
#endif

#if LWIP_IPV6 && LWIP_IPV6_MLD
/*
 * Function called by the lwIP stack to add or delete an entry in the IPv6 multicast filter table of the Ethernet MAC.
 */
static err_t mld_mac_filter(struct netif *iface, const ip6_addr_t *group, enum netif_mac_filter_action action)
{
    whd_mac_t macaddr;
    cy_rslt_t res;
    const uint8_t *ptr = (const uint8_t *)group->addr;
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    /* Convert the IPv6 multicast address to the MAC address.
     * The first two octets of the converted MAC address are fixed values (0x33 and 0x33).
     * The last four octets are the last four octets of the IPv6 multicast address.
     */
    macaddr.octet[0] = IPV6_MULTICAST_TO_MAC_PREFIX ;
    macaddr.octet[1] = IPV6_MULTICAST_TO_MAC_PREFIX ;
    macaddr.octet[2] = ptr[12] ;
    macaddr.octet[3] = ptr[13] ;
    macaddr.octet[4] = ptr[14] ;
    macaddr.octet[5] = ptr[15] ;

    switch ( action )
    {
        case NETIF_ADD_MAC_FILTER:
            res = whd_wifi_register_multicast_address( (whd_interface_t)if_ctx->hw_interface, &macaddr );
            if (  res != CY_RSLT_SUCCESS )
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_register_multicast_address call failed, err = %lx\n", res);
                return ERR_VAL;
            }
            break;

        case NETIF_DEL_MAC_FILTER:
            res = whd_wifi_unregister_multicast_address( (whd_interface_t)if_ctx->hw_interface, &macaddr );
            if ( res != CY_RSLT_SUCCESS )
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_unregister_multicast_address call failed, err = %lx\n", res);
                return ERR_VAL;
            }
            break;

        default:
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid MAC Filter Action: %d\n", action);
            return ERR_VAL;
    }

    return ERR_OK;
}
#endif

/*
 * This function is called when adding the Wi-Fi network interface to lwIP,
 * it actually performs the initialization for the netif interface.
 */
static err_t wifiinit(struct netif *iface)
{
    cy_rslt_t res;
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    whd_mac_t macaddr;
    whd_interface_t whd_iface = (whd_interface_t)if_ctx->hw_interface;
#ifdef COMPONENT_43907
    whd_buffer_t buffer;
    whd_buffer_t response;
    uint32_t *wlan_rand = NULL;
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    /*
     * Set the MAC address of the interface
     */
    res = whd_wifi_get_mac_address(whd_iface, &macaddr);

    if (res != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_get_mac_address call failed, err = %lx\n", res);
        return res ;
    }
    memcpy(&iface->hwaddr, &macaddr, sizeof(macaddr));
    iface->hwaddr_len = sizeof(macaddr);

#ifdef COMPONENT_43907
    /*
     * CYW43907 kits do not have the TRNG module. Get a random number from the WLAN and feed
     * it as a seed to the PRNG function.
     * Before invoking whd_cdc_get_iovar_buffer, WHD interface should be initialized.
     * However, wcminit is called from cy_lwip_add_interface; the WHD interface is an
     * input to the cy_lwip_add_interface API. So it is safe to invoke
     * whd_cdc_get_iovar_buffer here.
     */
    if (NULL != whd_cdc_get_iovar_buffer(whd_iface->whd_driver, &buffer, WLC_GET_RANDOM_BYTES, IOVAR_STR_RAND) )
    {
        whd_result_t whd_result;
        whd_result = whd_cdc_send_iovar(whd_iface, CDC_GET, buffer, &response);
        if (whd_result != WHD_SUCCESS)
        {
            whd_buffer_release(whd_iface->whd_driver, response, WHD_NETWORK_RX);
            return ERR_IF;
        }
        wlan_rand = (uint32_t *)whd_buffer_get_current_piece_data_pointer(whd_iface->whd_driver, response);
        if ( wlan_rand == NULL )
        {
            whd_buffer_release(whd_iface->whd_driver, response, WHD_NETWORK_RX);
            return ERR_IF;
        }
    }
    else
    {
        return ERR_IF;
    }

    /* Initialize the mutex to protect the PRNG WELL512 state */
    if (cy_prng_mutex_ptr == NULL)
    {
        cy_prng_mutex_ptr = &cy_prng_mutex;
        cy_rtos_init_mutex(cy_prng_mutex_ptr);
    }
    /* Feed the random number obtained from the WLAN to the WELL512
     * algorithm as the initial seed value.
     */
    cy_prng_add_entropy((const void *)wlan_rand, 4);

