Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
    /*
     * Free the WHD buffer used to get the random number from the WLAN.
     */
    whd_buffer_release(whd_iface->whd_driver, response, WHD_NETWORK_RX);
#endif
    /*
     * Set up the information associated with sending packets
     */
#if LWIP_IPV4
    iface->output = etharp_output;
#endif
    iface->linkoutput = wifioutput;
    iface->mtu = WHD_LINK_MTU;
    iface->flags |= (NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_IGMP) ;
#if LWIP_IPV6_MLD
    iface->flags |= NETIF_FLAG_MLD6;
#endif
    /*
     * Set the interface name for the interface
     */
    iface->name[0] = 'w' ;
    iface->name[1] = 'l' ;

#if LWIP_IPV4 && LWIP_IGMP
    netif_set_igmp_mac_filter(iface, igmp_filter) ;
#endif


#if LWIP_IPV6 == 1
    /*
     * Filter the output packets for IPv6 through the Ethernet output
     * function for IPv6
     */
    iface->output_ip6 = ethip6_output ;

    /*
     * Automatically generate a unicast IP address based on
     * neighbor discovery
     */
    iface->ip6_autoconfig_enabled = 1 ;

    /*
     * Create a link-local IPv6 address
     */
    netif_create_ip6_linklocal_address(iface, 1);

    /*
     * Tell the radio that you want to listen to solicited-node multicast
     * packets. These packets are part of the IPv6 neighbor discovery
     * process.
     */
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[2] = 0xff ;
    whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr) ;

    /*
     * Tell the radio that you want to listen to the multicast address
     * that targets all IPv6 devices. These packets are part of the IPv6
     * neighbor discovery process.
     */
    memset(&macaddr, 0, sizeof(macaddr)) ;
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[5] = 0x01 ;
    whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr) ;

#if LWIP_IPV6_MLD
    /*
     * Register the MLD MAC filter callback function that will be called by the lwIP stack to add or delete an
     * entry in the IPv6 multicast filter table of the Ethernet MAC
     */
    netif_set_mld_mac_filter(iface, mld_mac_filter);
#endif
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return 0 ;
}
#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
static cy_rslt_t cy_buffer_pool_create(uint32_t no_of_buffers, uint32_t sizeof_buffer, cy_internal_buffer_pool_t **handle)
{
    uint16_t header_size;
    uint8_t *data_buffer = NULL;
    uint8_t *data_buffer_aligned = NULL;

    int count = 1;
    list_node_t *current_node = NULL;

    /* Allocate memory for the pool handle */
    cy_internal_buffer_pool_t *pool_handle = calloc(1, sizeof(cy_internal_buffer_pool_t));
    if (NULL == pool_handle)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to allocate memory for buffer pool manager handle\n");
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buf pool handle : [%0x]\n", pool_handle);

    header_size = sizeof(list_node_t);

    /* Allocate memory for the actual buffer. Allocate additional MEM_BYTE_ALIGNMENT bytes to accommodate if the pointer returned is not 32 byte aligned */
    data_buffer = malloc((no_of_buffers * sizeof_buffer) + (header_size * no_of_buffers) + MEM_BYTE_ALIGNMENT);

    if (NULL == data_buffer)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to allocate memory for actual data\n");
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Base address of allocated buffer : [%0x] sizeof(list_node_t):[%d]\n", data_buffer, sizeof(list_node_t));

    pool_handle->total_num_buf_created = no_of_buffers;
    pool_handle->sizeof_buffer = sizeof_buffer;
    pool_handle->data_buffer = data_buffer;

    /* Update the allocated data_buffer pointer to be 32 byte aligned */
    data_buffer_aligned = (uint8_t*)((size_t)data_buffer + ((size_t)MEM_BYTE_ALIGNMENT - ((size_t)data_buffer & 0x1F)));
    /* Iterate over and build up the chain of buffers */
    while (count <= no_of_buffers)
    {
        list_node_t *node = (list_node_t*) data_buffer_aligned;

        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Creating buffer no [%d]....\n", count);

        node->pool_handle = pool_handle;
        node->next = NULL;
        node->buffer_ptr = data_buffer_aligned + header_size;

        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buffer node addr : [%0x], actual buffer addr : [%0x]\n", node, node->buffer_ptr);

        /* If the first node should be added to the list, change the head pointer */
        if (pool_handle->head == NULL)
        {
            pool_handle->head = node;
            current_node = node;
        }
        else
        {
            current_node->next = node;
            current_node = node;
        }

        data_buffer_aligned += sizeof_buffer + header_size;

        count++;
    }

    *handle = pool_handle;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_buffer_pool_get(cy_buffer_t *buffer, cy_internal_buffer_pool_t *pool_handle)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    list_node_t *list_node = NULL;

    /* If there are no free available buffer in the list, then return error */
    if (pool_handle->head == NULL)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "No available buffers");
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    else
    {
        list_node = pool_handle->head;
        /* Make the free available node as head */
        pool_handle->head = list_node->next;

        *buffer = (void *)list_node->buffer_ptr;
    }
    return result;
}

static void cy_buffer_pool_delete(cy_internal_buffer_pool_t *pool_handle)
{
    free(pool_handle->data_buffer);
    free(pool_handle);
    pool_handle = NULL;
}
#endif
#endif

cy_rslt_t cy_network_init( void )
{
#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
    cy_worker_thread_params_t params;
    cy_buffer_t get_buffer = NULL;
    uint8_t *pbuffer = NULL;
    cy_rx_buffer_info_t *rx_info;
    cy_rslt_t result;
#endif
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

