Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
    if( connectivity_lib_init )
    {
        connectivity_lib_init++;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n Connectivity library is already initialized.\n");
        return CY_RSLT_SUCCESS;
    }

    /** Initialize TCP ip stack, LWIP init is called through tcpip_init **/
    if(!is_tcp_initialized)
    {
        /*Network stack initialization*/
        tcpip_init(NULL, NULL);
        is_tcp_initialized = true;
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n tcpip_init success.\n");

    /*Memory to store iface_context. Currently, 4 contexts*/
    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        memset(&(iface_context_database[i]), 0, sizeof(cy_network_interface_context) );
    }

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1

    /* Create the RX worker thread */
    memset(&params, 0, sizeof(params));
    params.name = "ETH_RX_Worker";
    params.priority = CM_RX_WORKER_THREAD_PRIORITY;
    params.stack = NULL;
    params.stack_size = CM_RX_WORKER_THREAD_STACK_SIZE;
    params.num_entries = CM_RX_WORKER_THREAD_QUEUE_SIZE;

    if(cy_worker_thread_create(&cy_rx_worker_thread, &params) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "worker thread creation failed \n");
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    if(cy_rtos_init_queue(&rx_input_buffer_queue, NO_OF_BUFFERS, sizeof(uint32_t)) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to initialize queue to store input free buffers\n");
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    if(cy_buffer_pool_create(NO_OF_BUFFERS, (sizeof(cy_rx_buffer_info_t) + CY_ETH_SIZE_MAX_FRAME), &rx_pool_handle)!= CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to create buffer pool\n");
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }

    /* Initialize tx mutex */
    if( cy_rtos_init_mutex(&tx_mutex) != CY_RSLT_SUCCESS )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_mutex failed\n" );
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    /* Initialize tx semaphore */
    if( cy_rtos_init_semaphore( &tx_semaphore, 1, 0) != CY_RSLT_SUCCESS )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_semaphore failed\n");
        cy_rtos_deinit_mutex(&tx_mutex);
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    /* Create a worker thread for handling TX callback events */
    memset(&params, 0, sizeof(params));
    params.name = "ETH_TX_Worker";
    params.priority = CM_TX_WORKER_THREAD_PRIORITY;
    params.stack = NULL;
    params.stack_size = CM_TX_WORKER_THREAD_STACK_SIZE;
    params.num_entries = CM_TX_WORKER_THREAD_QUEUE_SIZE;

    /* Create a worker thread */
    if(cy_worker_thread_create(&cy_tx_worker_thread, &params) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "worker thread creation failed \n");
        cy_rtos_deinit_semaphore(&tx_semaphore);
        cy_rtos_deinit_mutex(&tx_mutex);
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Get all the buffers from pool and push to rx queue\n");

    for(int i = 0; i < rx_pool_handle->total_num_buf_created; i++)
    {
        /* Get the buffer from pool */
        if(cy_buffer_pool_get(&get_buffer, rx_pool_handle)!= CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to get the buffer from pool\n");
            result = CY_RSLT_NETWORK_ERROR_NOMEM;
            goto exit;
        }

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buffer from pool : [%p]\n", get_buffer);

        /* Push the free buffer to the queue */
        if(cy_rtos_put_queue(&rx_input_buffer_queue, &get_buffer, CY_RTOS_NEVER_TIMEOUT, false) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to push the free buffer to queue\n");
            result = CY_RSLT_NETWORK_ERROR_RTOS;
            goto exit;
        }
    }

    for(int i = 0; i < CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE; i++)
    {
        if(cy_rtos_get_queue(&rx_input_buffer_queue, (void *)&pbuffer, 0, true) != CY_RSLT_SUCCESS)
        {
            /* Failed to get a free buffer from the queue. */
            result = CY_RSLT_NETWORK_ERROR_RTOS;
            goto exit;
        }

        rx_info = (cy_rx_buffer_info_t *)pbuffer;
        rx_info->rx_data_ptr = (uint8_t *)(pbuffer + sizeof(cy_rx_buffer_info_t));

        pRx_Q_buff_pool[i] = (uint8_t *)&rx_info->rx_data_ptr;
    }
#endif
#endif

    connectivity_lib_init++;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1

exit:
    cy_worker_thread_delete(&cy_tx_worker_thread);
    cy_rtos_deinit_semaphore(&tx_semaphore);
    cy_rtos_deinit_mutex(&tx_mutex);
    cy_buffer_pool_delete(rx_pool_handle);
    cy_rtos_deinit_queue(&rx_input_buffer_queue);
    cy_worker_thread_delete(&cy_rx_worker_thread);
    return result;

#endif
#endif
}

cy_rslt_t cy_network_deinit( void )
{

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if( connectivity_lib_init == 0 )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"\n Connectivity library is De-initialized.\n");
        return CY_RSLT_SUCCESS;
    }
    else
    {
        connectivity_lib_init--;
        if(connectivity_lib_init == 0)
        {

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
            /* Delete the rx worker thread */
            cy_worker_thread_delete(&cy_rx_worker_thread);

            /* Delete the rx queue */
            cy_rtos_deinit_queue(&rx_input_buffer_queue);

            /* Delete the rx pool */
            cy_buffer_pool_delete(rx_pool_handle);

