Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
            /* Delete the tx worker thread */
            cy_worker_thread_delete(&cy_tx_worker_thread);

            /* Delete the tx semaphore */
            cy_rtos_deinit_semaphore(&tx_semaphore);

            /* Delete the tx mutex */
            cy_rtos_deinit_mutex(&tx_mutex);

#endif
#endif
        }
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_add_nw_interface(cy_network_hw_interface_type_t iface_type, uint8_t iface_idx,
                                         void *hw_interface, uint8_t *mac_address,
                                         cy_network_static_ip_addr_t *static_ipaddr,
                                         cy_network_interface_context **iface_context)
{
    bool iface_found = false;
    uint8_t index = 0;
#if LWIP_IPV4
    ip4_addr_t ipaddr, netmask, gateway ;
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if (iface_context == NULL || hw_interface == NULL || (iface_idx >= MAX_ETHERNET_PORT))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (iface_count >= CY_IFACE_MAX_HANDLE)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
        return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
    }

    /* Static IP address is mandatory for AP */
    if((iface_type == CY_NETWORK_WIFI_AP_INTERFACE) && (static_ipaddr == NULL))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error static IP addr cannot be NULL for AP interface \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /*Check if the interface is already added*/
    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if( ( iface_context_database[i].is_initialized == true ) &&
            ( iface_context_database[i].iface_type == iface_type ) &&
            ( iface_context_database[i].iface_idx == iface_idx ) )
        {
           iface_found = true;
           *iface_context = &(iface_context_database[i]);

           break;
        }
    }

    if(iface_found == true)
    {
        iface_idx = ((iface_type == CY_NETWORK_ETH_INTERFACE)? (CY_NETWORK_ETH_INTERFACE + iface_idx) : iface_type);
        if (is_interface_added((uint8_t)iface_idx))
        {
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Interface already exists \n");
            return CY_RSLT_NETWORK_INTERFACE_EXISTS;
        }
    }
    else
    {
        /*No duplicate; check for an available index and update the interface database*/
        for( index = 0; index < CY_IFACE_MAX_HANDLE; index++ )
        {
            if( iface_context_database[index].is_initialized == false )
            {
                iface_context_database[index].iface_type = iface_type;
                iface_context_database[index].iface_idx  = iface_idx;

                iface_context_database[index].hw_interface = hw_interface;
                cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG," Adding interface \n");

                *iface_context = &(iface_context_database[index]);
                break;
            }
        }
    }

#if LWIP_IPV4
    /* Assign the IP address if static; otherwise, zero the IP address */
    if (static_ipaddr != NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static_ipaddr is NOT NULL \n");

#ifdef ENABLE_CONNECTIVITY_MIDDLEWARE_LOGS
#define IPV4_MAX_STR_LEN 15
    char ip_str[IPV4_MAX_STR_LEN];
    cy_nw_ntoa(&(static_ipaddr->addr), ip_str);
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static ipaddr assigned %s assigned \n", ip_str);
    cy_nw_ntoa(&(static_ipaddr->gateway), ip_str);
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static gateway assigned %s assigned \n", ip_str);
    cy_nw_ntoa(&(static_ipaddr->netmask), ip_str);
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static netmask assigned %s assigned \n", ip_str);
#endif

        memcpy(&gateway, &static_ipaddr->gateway.ip.v4, sizeof(gateway));
        memcpy(&ipaddr, &static_ipaddr->addr.ip.v4, sizeof(ipaddr));
        memcpy(&netmask, &static_ipaddr->netmask.ip.v4, sizeof(netmask));
    }
    else
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static_ipaddr is NULL \n");
        memset(&gateway, 0, sizeof(gateway));
        memset(&ipaddr, 0, sizeof(ipaddr));
        memset(&netmask, 0, sizeof(netmask));
    }
#endif

    /* update netif structure */
#if defined(CYBSP_WIFI_CAPABLE)
    if( CY_NETWORK_WIFI_STA_INTERFACE == iface_context_database[index].iface_type || CY_NETWORK_WIFI_AP_INTERFACE == iface_context_database[index].iface_type )
    {
        /* Assign network instance to the iface database */
        iface_context_database[index].nw_interface = LWIP_IP_HANDLE(iface_context_database[index].iface_type);
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"iface_context_database[index].nw_interface:[%p]\n", iface_context_database[index].nw_interface);

        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"iface_context_database[index].hw_interface:[%p] hw_interface:[%p]\n", iface_context_database[index].hw_interface, hw_interface);
#if LWIP_IPV4
        /* Add the interface to the lwIP stack and make it the default */
        if(netifapi_netif_add(iface_context_database[index].nw_interface, &ipaddr, &netmask, &gateway, &iface_context_database[index], wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#else
        if(netifapi_netif_add(iface_context_database[index].nw_interface, &iface_context_database[index], wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#endif
    }

    if(iface_context_database[index].iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        if(static_ipaddr == NULL)
        {
            is_dhcp_client_required = true;
        }
        netifapi_netif_set_default(iface_context_database[index].nw_interface);
    }

#if LWIP_NETIF_STATUS_CALLBACK == 1
    /*
     * Register a handler for any address changes.
     * Note: The "status" callback will also be called when the interface
     * goes up or down.
     */
    netif_set_status_callback(iface_context_database[index].nw_interface, internal_ip_change_callback);
#endif /* LWIP_NETIF_STATUS_CALLBACK */

    SET_IP_NETWORK_INITED(iface_context_database[index].iface_type, true);

#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
    if( CY_NETWORK_ETH_INTERFACE == iface_context_database[index].iface_type)
    {
        /* Update the MAC address to iface database */
        memcpy((uint8_t *)&(iface_context_database[index].mac_address[0]), (uint8_t *)mac_address, CY_MAC_ADDR_LEN);

