Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
        /* Assign the network instance to the iface database */
        iface_context_database[index].nw_interface = LWIP_IP_HANDLE(iface_context_database[index].iface_type + iface_context_database[index].iface_idx);

#if LWIP_IPV4
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Add interface : [%p]for the netif assigned\n", iface_context_database[index].nw_interface);

        /* Add network interface to the netif_list */
        if(netifapi_netif_add(iface_context_database[index].nw_interface, &ipaddr, &netmask, &gateway, &iface_context_database[index], &ethernetif_init, &tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#else
        if(netifapi_netif_add(iface_context_database[index].nw_interface, &iface_context_database[index], &ethernetif_init, &tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#endif
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"iface_context_database[index].nw_interface:[%p]\n", iface_context_database[index].nw_interface);

        /*  Register the default network interface.*/
        netifapi_netif_set_default(iface_context_database[index].nw_interface);
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"Set default Interface:[%p]\n", LWIP_IP_HANDLE(iface_context_database[index].iface_type + iface_context_database[index].iface_idx));

        /* If callback enabled */
#if LWIP_NETIF_STATUS_CALLBACK == 1
        /* Initialize the interface status change callback */
        netif_set_status_callback(iface_context_database[index].nw_interface, internal_ip_change_callback);
#endif
        SET_IP_NETWORK_INITED((iface_context_database[index].iface_type + iface_context_database[index].iface_idx), true);
    }

    if(iface_context_database[index].iface_type == CY_NETWORK_ETH_INTERFACE)
    {
        if(static_ipaddr == NULL)
        {
            is_dhcp_client_required = true;
        }
    }

#endif


    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "added network net_interface:[%p] \n", iface_context_database[index].nw_interface);

    /* Update the interface initialized flag only after netif is added. This flag will be referred in Rx data handler */
    iface_context_database[index].is_initialized = true;

    /*Update the valid interface count: Used as max cap for interface addition*/

    iface_count++;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

void* cy_network_get_nw_interface(cy_network_hw_interface_type_t iface_type, uint8_t iface_idx)
{
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if( ((iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_type != CY_NETWORK_WIFI_AP_INTERFACE) && (iface_type != CY_NETWORK_ETH_INTERFACE))
        || (iface_idx >= MAX_ETHERNET_PORT) )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return NULL;
    }

    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if( ( iface_context_database[i].is_initialized == true ) &&
            ( iface_context_database[i].iface_type == iface_type ) &&
            ( iface_context_database[i].iface_idx == iface_idx ) )
        {
            return (void *)(iface_context_database[i].nw_interface);
        }
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return NULL;
}

cy_rslt_t cy_network_remove_nw_interface(cy_network_interface_context *iface_context)
{
    uint8_t interface_index;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if(is_interface_valid(iface_context) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    interface_index = (uint8_t)((iface_context->iface_type == CY_NETWORK_ETH_INTERFACE)? (CY_NETWORK_ETH_INTERFACE + iface_context->iface_idx) : iface_context->iface_type);

    /* Check any one interface is added */
    if(!iface_count)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Not added \n");
        return CY_RSLT_NETWORK_INTERFACE_DOES_NOT_EXIST;
    }

    /* Interface can be removed only if the interface was previously added and the network is down */
    if(!is_interface_added(interface_index))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Interface doesn't exist \n");
        return CY_RSLT_NETWORK_INTERFACE_DOES_NOT_EXIST;
    }

    if(is_network_up(interface_index))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error removing interface, bring down the network before removing the interface \n");
        return CY_RSLT_NETWORK_ERROR_REMOVING_INTERFACE;
    }

    /* Remove the status callback */
    netif_set_remove_callback(LWIP_IP_HANDLE(interface_index), internal_ip_change_callback);
    /* Remove the interface */
    netifapi_netif_remove(LWIP_IP_HANDLE(interface_index));
    if(iface_context->iface_type == CY_NETWORK_WIFI_STA_INTERFACE || iface_context->iface_type == CY_NETWORK_ETH_INTERFACE)
    {
        is_dhcp_client_required = false;
    }

    SET_IP_NETWORK_INITED(interface_index, false);

#ifdef COMPONENT_43907
    /* cy_prng_mutex_ptr is initialized when the first network interface is initialized.
     * Deinitialize the mutex only after all the interfaces are deinitialized.
     */
    if (!ip_networking_inited[CY_NETWORK_WIFI_STA_INTERFACE] &&
        !ip_networking_inited[CY_NETWORK_WIFI_AP_INTERFACE])
    {
        if (cy_prng_mutex_ptr != NULL)
        {
            cy_rtos_deinit_mutex(cy_prng_mutex_ptr);
            cy_prng_mutex_ptr = NULL;
        }
    }
#endif

    /* Clear interface details from database */
    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if( ( iface_context_database[i].iface_type == iface_context->iface_type ) &&
            ( iface_context_database[i].iface_idx == iface_context->iface_idx ) )
        {
            iface_context_database[i].is_initialized = false;
            iface_context_database[i].nw_interface = NULL;
            iface_context_database[i].hw_interface = NULL;
        }
    }

    /*Update the valid interface count: Used as max cap for interface addition*/
    iface_count--;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_ip_up(cy_network_interface_context *iface)
{
    cy_rslt_t result                     = CY_RSLT_SUCCESS;
    uint8_t   interface_index;
#if LWIP_IPV4
    uint32_t    address_resolution_timeout = 0;
    bool        timeout_occurred = false;
    ip4_addr_t  ip_addr;
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

