Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
    interface_index = (uint8_t)((iface->iface_type == CY_NETWORK_ETH_INTERFACE)? (CY_NETWORK_ETH_INTERFACE + iface->iface_idx) : iface->iface_type);
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "interface_index:[%d] \n", interface_index);

    if(is_network_up(interface_index))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Network is already up \n");
        return CY_RSLT_SUCCESS;
    }

    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack,
     * before invoking the lwIP APIs that requires TCP core lock
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /*
    * Bring up the network interface
    */
    netifapi_netif_set_up((LWIP_IP_HANDLE(interface_index)));

    /*
    * Bring up the network link layer
    */
    netifapi_netif_set_link_up((LWIP_IP_HANDLE(interface_index)));

#if LWIP_IPV6
    /* Wait for the IPv6 address to change from tentative to valid or invalid */
    while(ip6_addr_istentative(netif_ip6_addr_state(LWIP_IP_HANDLE(interface_index), 0)))
    {
        /* Give the lwIP stack time to change the state */
        cy_rtos_delay_milliseconds(ND6_TMR_INTERVAL);
    }

    /* lwIP changes state to either INVALID or VALID. Check if the state is VALID */
    if(ip6_addr_isvalid(netif_ip6_addr_state(LWIP_IP_HANDLE(interface_index), 0)))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 Network ready IP: %s \r\n", ip6addr_ntoa(netif_ip6_addr(LWIP_IP_HANDLE(interface_index), 0)));
    }
    else
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 network not ready \r\n");
    }
#endif

#if LWIP_IPV4
    if(iface->iface_type == CY_NETWORK_WIFI_STA_INTERFACE || iface->iface_type == CY_NETWORK_ETH_INTERFACE)
    {
        if(is_dhcp_client_required)
        {
            /* TO DO :  Save the current power save state */
            /* TO DO :  Disable power save for the DHCP exchange */

            /*
             * For DHCP only, reset netif IP address
             *to avoid reusing the previous netif IP address
             * given from the previous DHCP session.
             */
            ip4_addr_set_zero(&ip_addr);

            /*
             * If LPA is enabled, invoke the activity callback to resume the network stack
             * before invoking the lwIP APIs that require the TCP core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            netif_set_ipaddr(LWIP_IP_HANDLE(interface_index), &ip_addr);

            /*
             * If LPA is enabled, invoke the activity callback to resume the network stack
             * before invoking the lwIP APIs that require the TCP core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            /* TO DO : DHCPv6 need to be handled when we support IPV6 addresses other than the link local address */
            /* Start DHCP */
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start DHCP client netif:[%p]\n", LWIP_IP_HANDLE(interface_index) );
            if(netifapi_dhcp_start(LWIP_IP_HANDLE(interface_index)) != CY_RSLT_SUCCESS)
            {
                cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "CY_RSLT_NETWORK_ERROR_STARTING_DHCP error\n");
                return CY_RSLT_NETWORK_ERROR_STARTING_DHCP;
            }
            /* Wait a little to allow DHCP to complete */

            while((netif_dhcp_data(LWIP_IP_HANDLE(interface_index))->state != DHCP_STATE_BOUND) && (timeout_occurred == false))
            {
                cy_rtos_delay_milliseconds(10);
                address_resolution_timeout += 10;
                if(address_resolution_timeout >= DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS)
                {
                    /* Timeout has occurred */
                    timeout_occurred = true;
                }
            }

            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netif_dhcp_data(LWIP_IP_HANDLE(interface_index))->state:[%d]\n",netif_dhcp_data(LWIP_IP_HANDLE(interface_index))->state);
            if (timeout_occurred)
            {
                /*
                 * If LPA is enabled, invoke the activity callback to resume the network stack
                 * before invoking the lwIP APIs that require the TCP core lock.
                 */
                if (activity_callback)
                {
                    activity_callback(true);
                }
                netifapi_dhcp_release_and_stop(LWIP_IP_HANDLE(interface_index));
#if LWIP_AUTOIP
                int   tries = 0;
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Unable to obtain IP address via DHCP. Perform Auto IP\n");
                address_resolution_timeout = 0;
                timeout_occurred            = false;

                /*
                 * If LPA is enabled, invoke the activity callback to resume the network stack
                 * before invoking the lwIP APIs that require the TCP core lock.
                 */
                if (activity_callback)
                {
                    activity_callback(true);
                }

                if (autoip_start(LWIP_IP_HANDLE(interface_index) ) != ERR_OK )
                {
                    /* trick: Skip the while-loop, do the cleaning up stuff */
                    timeout_occurred = true;
                }

                while ((timeout_occurred == false) && ((netif_autoip_data(LWIP_IP_HANDLE(interface_index))->state != AUTOIP_STATE_BOUND)))
                {
                    cy_rtos_delay_milliseconds(10);
                    address_resolution_timeout += 10;
                    if(address_resolution_timeout >= AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS)
                    {
                        if(tries++ < MAX_AUTO_IP_RETRIES)
                        {
                            address_resolution_timeout = 0;
                        }
                        else
                        {
                            timeout_occurred = true;
                        }
                     }
                }

