Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
cy_rslt_t cy_network_get_ip_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *ip_addr)
{
#if LWIP_IPV4
    struct netif *net_interface  = NULL;
    uint32_t ipv4_addr;
    ip4_addr_t* addr = NULL;

    UNUSED_VARIABLE(addr);

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if((ip_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)iface_context->nw_interface;

#if LWIP_IPV6
        ipv4_addr = net_interface->ip_addr.u_addr.ip4.addr;
        addr = &net_interface->ip_addr.u_addr.ip4;
#else
        ipv4_addr = net_interface->ip_addr.addr;
        addr = &net_interface->ip_addr;
#endif

    ip_addr->version = NW_IP_IPV4;
    ip_addr->ip.v4 = ipv4_addr;
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IP Address %s assigned \n", ip4addr_ntoa(addr));

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_ipv6_address(cy_network_interface_context *iface_context, cy_network_ipv6_type_t type, cy_nw_ip_address_t *ip_addr)
{
#if LWIP_IPV6
    struct netif *net_interface  = NULL;
    const ip6_addr_t* ipv6_addr  = NULL;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if((ip_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)iface_context->nw_interface;

    ipv6_addr = netif_ip6_addr(net_interface, 0);
    if(ipv6_addr != NULL)
    {
        ip_addr->version = NW_IP_IPV6;
        ip_addr->ip.v6[0] = ipv6_addr->addr[0];
        ip_addr->ip.v6[1] = ipv6_addr->addr[1];
        ip_addr->ip.v6[2] = ipv6_addr->addr[2];
        ip_addr->ip.v6[3] = ipv6_addr->addr[3];

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %s assigned \n", ip6addr_ntoa(netif_ip6_addr(net_interface, 0)));
    }
    else
    {
        memset(ip_addr, 0, sizeof(cy_nw_ip_address_t));
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready \n");
        return CY_RSLT_NETWORK_IPV6_INTERFACE_NOT_READY;
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV6 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_gateway_ip_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *gateway_addr)
{
#if LWIP_IPV4
    struct netif *net_interface  = NULL;
    uint32_t ipv4_addr;
    ip4_addr_t* addr = NULL;

    UNUSED_VARIABLE(addr);

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if((gateway_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)(iface_context->nw_interface);

#if LWIP_IPV6
    ipv4_addr = net_interface->gw.u_addr.ip4.addr;
    addr = &net_interface->gw.u_addr.ip4;
#else
    ipv4_addr = net_interface->gw.addr;
    addr = &net_interface->gw;
#endif

    gateway_addr->version = NW_IP_IPV4;
    gateway_addr->ip.v4 = ipv4_addr;
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Gateway IP Address %s assigned \n", ip4addr_ntoa(addr));

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_gateway_mac_address(cy_network_interface_context *iface_context, cy_nw_ip_mac_t *mac_addr)
{
#if LWIP_IPV4
    err_t err;
    cy_nw_ip_address_t gateway_ip_addr;
    struct eth_addr *eth_ret = NULL;
    const ip4_addr_t *ip_ret = NULL;
    int32_t arp_waittime = ARP_WAIT_TIME_IN_MSEC;
    ssize_t arp_index = -1;
    ip4_addr_t ipv4addr;
    struct netif *net_interface  = NULL;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if((mac_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)(iface_context->nw_interface);

    if (cy_network_get_gateway_ip_address(iface_context, &gateway_ip_addr) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_network_get_gateway_ip_address failed\n" );
        return  CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
    }

    ipv4addr.addr = gateway_ip_addr.ip.v4;

    /* Check if the gateway address entry is already present in the ARP cache */
    arp_index = etharp_find_addr(net_interface, (const ip4_addr_t *) &ipv4addr, &eth_ret, (const ip4_addr_t **) &ip_ret);
    if(arp_index == -1)
    {
        /* Address entry is not present in the ARP cache. Send the ARP request.*/
        err = etharp_request(net_interface, (const ip4_addr_t *) &ipv4addr);
        if(err != ERR_OK)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "etharp_request failed with error %d\n", err);
            return  CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
        }

        do
        {
            arp_index = etharp_find_addr(net_interface, (const ip4_addr_t *) &ipv4addr, &eth_ret, (const ip4_addr_t **) &ip_ret);
            if(arp_index != -1)
            {
                 cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "arp entry found \r\n");
                 break;
            }
            cy_rtos_delay_milliseconds(ARP_CACHE_CHECK_INTERVAL_IN_MSEC);
            arp_waittime -= ARP_CACHE_CHECK_INTERVAL_IN_MSEC;
            if(arp_waittime <= 0)
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Could not resolve MAC address for the given destination address \r\n");
                return CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
            }
        } while(1);

