Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
    }

    memcpy(mac_addr, eth_ret->addr, CY_MAC_ADDR_LEN);

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_netmask_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *net_mask_addr)
{
#if LWIP_IPV4
    struct netif *net_interface  = NULL;
    uint32_t ipv4_addr;
    ip4_addr_t* addr = NULL;

    UNUSED_VARIABLE(addr);

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if((net_mask_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)(iface_context->nw_interface);

#if LWIP_IPV6
    ipv4_addr = net_interface->netmask.u_addr.ip4.addr;
    addr = &net_interface->netmask.u_addr.ip4;
#else
    ipv4_addr = net_interface->netmask.addr;
    addr = &net_interface->netmask;
#endif

    net_mask_addr->version = NW_IP_IPV4;
    net_mask_addr->ip.v4 = ipv4_addr;
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "net mask IP Address %s assigned \n", ip4addr_ntoa(addr));

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_dhcp_renew(cy_network_interface_context *iface)
{
#if LWIP_IPV4
    uint8_t interface_index;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    interface_index = (uint8_t)((iface->iface_type == CY_NETWORK_ETH_INTERFACE)? (CY_NETWORK_ETH_INTERFACE + iface->iface_idx) : iface->iface_type);

    /* Invalidate ARP entries */
    netifapi_netif_common(LWIP_IP_HANDLE(interface_index), (netifapi_void_fn) invalidate_all_arp_entries, NULL );


    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack
     * before invoking the lwIP APIs that require the TCP core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /* Renew DHCP */
    netifapi_netif_common(LWIP_IP_HANDLE(interface_index), (netifapi_void_fn)dhcp_renew, NULL);

    cy_rtos_delay_milliseconds(DCHP_RENEWAL_DELAY_IN_MS);

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

/**
 * Remove all ARP table entries of the specified netif.
 * @param netif Points to a network interface
 */
#if LWIP_IPV4
static void invalidate_all_arp_entries(struct netif *netif)
{
     /*Free all entries in ARP list */
    etharp_cleanup_netif(netif);
}
#endif

cy_rslt_t cy_network_ping(void *iface_context, cy_nw_ip_address_t *address, uint32_t timeout_ms, uint32_t* elapsed_time_ms)
{
#if LWIP_IPV4
    cy_time_t send_time;
    cy_time_t recvd_time;
    err_t err;
    struct timeval timeout_val;
    struct icmp_packet ping_packet;
    uint16_t ping_seq_num = 0;
    int socket_for_ping = -1;
    struct netif *net_interface;
    char if_name[PING_IF_NAME_LEN];
    struct ifreq iface;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if(iface_context == NULL || address == NULL || elapsed_time_ms == NULL)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface_context;

    /* Open a local socket for pinging */
    socket_for_ping = lwip_socket(AF_INET, SOCK_RAW, IP_PROTO_ICMP);
    if (socket_for_ping < 0)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "lwiP socket open error \n");
        goto exit;
    }

    /* Convert the timeout into struct timeval */
    timeout_val.tv_sec  = (long)(timeout_ms / 1000);
    timeout_val.tv_usec = (long)((timeout_ms % 1000) * 1000);
    /* Set the receive timeout on the local socket, so ping will time out */
    if(lwip_setsockopt(socket_for_ping, SOL_SOCKET, SO_RCVTIMEO, &timeout_val, sizeof(struct timeval)) != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "lwip socket setting receive timeout error \n");
        goto exit;
    }

    /* Bind the interface to the device */
    net_interface = (struct netif *)if_ctx->nw_interface;
    memset(&iface, 0, sizeof(iface));
    memcpy(if_name, net_interface->name, sizeof(net_interface->name));
    snprintf(&if_name[2], (PING_IF_NAME_LEN - 2), "%u", (uint8_t)(net_interface->num));
    memcpy(iface.ifr_name, if_name, PING_IF_NAME_LEN);
    if(lwip_setsockopt(socket_for_ping, SOL_SOCKET, SO_BINDTODEVICE, &iface, sizeof(iface)) != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "lwip socket setting socket bind error \n");
        goto exit;
    }

    /* Send a ping request */
    err = ping_send(socket_for_ping, address, &ping_packet, &ping_seq_num);
    if (err != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "sending ping failed\n");
        goto exit;
    }
    /* Record the time the ping request was sent */
    cy_rtos_get_time(&send_time);

    /* Wait for the ping reply */
    err = ping_recv(socket_for_ping, address, &ping_seq_num);
    if (err != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "receiving ping failed\n");
        goto exit;
    }

