Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_network_mw_core.c
    /* Compute the elapsed time since a ping request was initiated */
    cy_rtos_get_time(&recvd_time);
    *elapsed_time_ms = (uint32_t)(recvd_time - send_time);

exit:
    /* Close the socket */
    if(socket_for_ping >= 0)
    {
        lwip_close(socket_for_ping);
    }
    return result;
#else
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

#ifdef CYBSP_WIFI_CAPABLE
/* Used to register callback for EAPOL packets */
cy_rslt_t cy_wifimwcore_eapol_register_receive_handler( cy_wifimwcore_eapol_packet_handler_t eapol_packet_handler )
{
    internal_eapol_packet_handler = eapol_packet_handler;
    return CY_RSLT_SUCCESS;
}
#endif

#if LWIP_IPV4
static void ping_prepare_echo(struct icmp_packet *iecho, uint16_t len, uint16_t *ping_seq_num)
{
    int i;
    ICMPH_TYPE_SET(&iecho->hdr, ICMP_ECHO);
    ICMPH_CODE_SET(&iecho->hdr, 0);
    iecho->hdr.chksum = 0;
    iecho->hdr.id = PING_ID;
    iecho->hdr.seqno = htons(++(*ping_seq_num));

    /* Fill the additional data buffer with some data */
    for ( i = 0; i < (int)sizeof(iecho->data); i++ )
    {
        iecho->data[i] = (uint8_t)i;
    }

#ifndef COMPONENT_CAT3
    iecho->hdr.chksum = inet_chksum(iecho, len);
#endif
}

static err_t ping_send(int socket_hnd, const cy_nw_ip_address_t* address, struct icmp_packet *iecho, uint16_t *sequence_number)
{
    int                err;
    struct sockaddr_in to;

    /* Construct ping request */
    ping_prepare_echo(iecho, sizeof(struct icmp_packet), sequence_number);

    /* Send the ping request */
    to.sin_len         = sizeof( to );
    to.sin_family      = AF_INET;
    to.sin_addr.s_addr = address->ip.v4;

    err = lwip_sendto(socket_hnd, iecho, sizeof(struct icmp_packet), 0, (struct sockaddr*) &to, sizeof(to));

    return (err ? ERR_OK : ERR_VAL);
}

static err_t ping_recv(int socket_hnd, cy_nw_ip_address_t* address, uint16_t *ping_seq_num)
{
    char                  buf[PING_RESPONSE_LEN];
    int                   fromlen;
    int                   len;
    struct sockaddr_in    from;
    struct ip_hdr*        iphdr;
    struct icmp_echo_hdr* iecho;
    do
    {
        len = lwip_recvfrom(socket_hnd, buf, sizeof(buf), 0, (struct sockaddr*) &from, (socklen_t*) &fromlen);
        if (len >= (int) (sizeof(struct ip_hdr) + sizeof(struct icmp_echo_hdr)))
        {
            iphdr = (struct ip_hdr *) buf;
            iecho = (struct icmp_echo_hdr *) (buf + (IPH_HL(iphdr) * 4));

            if ((iecho->id == PING_ID) &&
                 (iecho->seqno == htons(*ping_seq_num)) &&
                 (ICMPH_TYPE(iecho) == ICMP_ER))
            {
                return ERR_OK; /* Echo reply received - return success */
            }
        }
    } while (len > 0);

    return ERR_TIMEOUT; /* No valid echo reply received before timeout */
}
#endif

static void internal_ip_change_callback (struct netif *netif)
{
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IP change callback triggered\n");
    /* Notify ECM about IP address change */
    if(ip_change_callback != NULL)
    {
        for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
        {
            if(netif == (struct netif *)iface_context_database[i].nw_interface)
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "netif:[%p] iface_context_database[i].nw_interface:[%p]\n", netif, iface_context_database[i].nw_interface);
                ip_change_callback(&(iface_context_database[i]), NULL);
                return;
            }
        }
    }
}

static bool is_interface_added(uint8_t interface_index)
{
    return (ip_networking_inited[interface_index & 3]);
}

static bool is_network_up(uint8_t interface_index)
{
    return (ip_up[interface_index & 3]);
}

static cy_rslt_t is_interface_valid(cy_network_interface_context *iface)
{
    if( (iface == NULL) ||
        (((iface->iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface->iface_type != CY_NETWORK_WIFI_AP_INTERFACE)) &&
        (iface->iface_type != CY_NETWORK_ETH_INTERFACE) && (iface->iface_idx >= MAX_ETHERNET_PORT))
      )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "iface->iface_type:[%d] iface->iface_idx:[%d]\n", iface->iface_type, iface->iface_idx);
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    return CY_RSLT_SUCCESS;
}

#ifdef COMPONENT_43907
/* CYW43907 kits do not have a TRNG module.
 * The following are the functions to generate pseudorandon numbers.
 * These functions are internal to the AnyCloud library; currently used
 * by Secure Sockets and WCM.
 */
static uint32_t crc32_calc( const uint8_t* buffer, uint16_t buffer_length, uint32_t prev_crc32 )
{
    uint32_t crc32 = ~prev_crc32;
    int i;

    for ( i = 0; i < buffer_length; i++ )
    {
        int j;

        crc32 ^= buffer[ i ];

        for ( j = 0; j < 8; j++ )
        {
            if ( crc32 & 0x1 )
            {
                crc32 = ( crc32 >> 1 ) ^ CY_PRNG_CRC32_POLYNOMIAL;
            }
            else
            {
                crc32 = ( crc32 >> 1 );
            }
        }
    }

    return ~crc32;
}

static uint32_t prng_well512_get_random( void )
{
    /*
     * Implementation of WELL (Well Equidistributed Long-period Linear) pseudorandom number generator.
     * Use the WELL512 source code placed by the inventor to public domain.
     */

    uint32_t a, b, c, d;
    uint32_t result;

    cy_rtos_get_mutex( cy_prng_mutex_ptr , CY_RTOS_NEVER_TIMEOUT);

    a = prng_well512_state[ prng_well512_index ];
    c = prng_well512_state[ ( prng_well512_index + 13 ) & 15 ];
    b = a ^ c ^ ( a << 16 ) ^ ( c << 15 );
    c = prng_well512_state[ ( prng_well512_index + 9 ) & 15 ];
    c ^= ( c >> 11 );
    a = prng_well512_state[ prng_well512_index ] = b ^ c;
    d = a ^ ( ( a << 5 ) & (uint32_t)0xDA442D24UL );
    prng_well512_index = ( prng_well512_index + 15 ) & 15;
    a = prng_well512_state[ prng_well512_index ];
    prng_well512_state[ prng_well512_index ] = a ^ b ^ d ^ ( a << 2 ) ^ ( b << 18 ) ^ ( c << 28 );

    result = prng_well512_state[ prng_well512_index ];

    cy_rtos_set_mutex( cy_prng_mutex_ptr );

    return result;
}

static void prng_well512_add_entropy( const void* buffer, uint16_t buffer_length )
{
    uint32_t crc32[ CY_PRNG_WELL512_STATE_SIZE ];
    uint32_t curr_crc32 = 0;
    unsigned i;

    for ( i = 0; i < CY_PRNG_WELL512_STATE_SIZE; i++ )
    {
        curr_crc32 = crc32_calc( buffer, buffer_length, curr_crc32 );
        crc32[ i ] = curr_crc32;
    }

    cy_rtos_get_mutex( cy_prng_mutex_ptr , CY_RTOS_NEVER_TIMEOUT);

    for ( i = 0; i < CY_PRNG_WELL512_STATE_SIZE; i++ )
    {
        prng_well512_state[ i ] ^= crc32[ i ];
    }

    cy_rtos_set_mutex( cy_prng_mutex_ptr );
}

static bool prng_is_add_cyclecnt_entropy( uint32_t buffer_length )
{
    bool add_entropy = false;

    cy_rtos_get_mutex( cy_prng_mutex_ptr , CY_RTOS_NEVER_TIMEOUT);

    if ( prng_add_cyclecnt_entropy_bytes >= CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE )
    {
        prng_add_cyclecnt_entropy_bytes %= CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE;
        add_entropy = true;
    }

    prng_add_cyclecnt_entropy_bytes += buffer_length;

    cy_rtos_set_mutex( cy_prng_mutex_ptr );

    return add_entropy;
}

static void prng_add_cyclecnt_entropy( uint32_t buffer_length )
{
    cy_rslt_t result;
    if ( prng_is_add_cyclecnt_entropy( buffer_length ) )
    {
        cy_time_t cycle_count;
        result = cy_rtos_get_time( &cycle_count );
        if (result == CY_RSLT_SUCCESS)
        {
            prng_well512_add_entropy( &cycle_count, sizeof( cycle_count ) );
        }
    }
    return;
}

cy_rslt_t cy_prng_get_random( void* buffer, uint32_t buffer_length )
{
    uint8_t* p = buffer;

    prng_add_cyclecnt_entropy( buffer_length );

    while ( buffer_length != 0 )
    {
        uint32_t rnd_val = prng_well512_get_random( );
        int      i;

        for ( i = 0; i < 4; i++ )
        {
            *p++ = (uint8_t)( rnd_val & 0xFF );
            if ( --buffer_length == 0 )
            {
                break;
            }
            rnd_val = ( rnd_val >> 8 );
        }
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_prng_add_entropy( const void* buffer, uint32_t buffer_length )
{
    prng_well512_add_entropy( buffer, buffer_length );
    return CY_RSLT_SUCCESS;
}
#endif
